# Working With Data in Pandas

# importing data in pandas

In [63]:
import pandas as pd
car_data = pd.read_csv('car_dataframe.csv')

In [64]:
car_data

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
0,Toyota,$2000,2,114,10000,2000,20000000
1,Mitsuibush,$2300,4,230,2000,200,400000
2,Datsun,$4000,4,345,9320,3200,29824000
3,Lexus,$2000,7,120,45000,10450,470250000
4,Toyota,$18000,4,110,2104,230,483920

# selecting and viewing row in dataframe

In [65]:
car_make_price = car_data[['car_make', 'car-price']]

In [66]:
car_make_price

     car_make car-price
0      Toyota     $2000
1  Mitsuibush     $2300
2      Datsun     $4000
3       Lexus     $2000
4      Toyota    $18000

In [67]:
car_data['car_make'] = car_data['car_make'].str.lower()

In [68]:
car_data

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
0,toyota,$2000,2,114,10000,2000,20000000
1,mitsuibush,$2300,4,230,2000,200,400000
2,datsun,$4000,4,345,9320,3200,29824000
3,lexus,$2000,7,120,45000,10450,470250000
4,toyota,$18000,4,110,2104,230,483920

In [69]:
# selecting where car seat is 4.
car_seat_is_4_or_toyota = car_data[(car_data['seat_number'] == 4) | (car_data['car_make'] == 'toyota')]

In [70]:
car_seat_is_4_or_toyota

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
0,toyota,$2000,2,114,10000,2000,20000000
1,mitsuibush,$2300,4,230,2000,200,400000
2,datsun,$4000,4,345,9320,3200,29824000
4,toyota,$18000,4,110,2104,230,483920

In [71]:
car_seat_4_and_toyota = car_data[(car_data['seat_number'] == 4) & (car_data['car_make'] == 'toyota')]

In [72]:
car_seat_4_and_toyota

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
4,toyota,$18000,4,110,2104,230,483920

## Using Loc and Iloc

In [73]:
car_data.loc[0:2]

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
0,toyota,$2000,2,114,10000,2000,20000000
1,mitsuibush,$2300,4,230,2000,200,400000
2,datsun,$4000,4,345,9320,3200,29824000

In [74]:
car_data.loc[car_data['horse_power'] > 200]

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
1,mitsuibush,$2300,4,230,2000,200,400000
2,datsun,$4000,4,345,9320,3200,29824000

In [75]:
car_data.iloc[0:2,2:4]

   seat_number  horse_power
0            2          114
1            4          230

In [76]:
car_unique = car_data['car_make'].unique()

In [77]:
car_unique

array(['toyota', 'mitsuibush', 'datsun', 'lexus'], dtype=object)